py3Project/complicate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <nshead:requesthead xmlns:nshead="http://pub.webservice.cmp.com">
            <nshead:request_type>Q01</nshead:request_type>
            <nshead:uuid>VW1600010759hGn6Pc8z</nshead:uuid>
            <nshead:server_version>00000000</nshead:server_version>
            <nshead:sender>0531</nshead:sender>
            <nshead:user>0531</nshead:user>
            <nshead:password>0531</nshead:password>
            <nshead:areacode></nshead:areacode>
            <nshead:ChnlNo>saic</nshead:ChnlNo>
            <nshead:flowintime>2016-06-03 16:41:39</nshead:flowintime>
        </nshead:requesthead>
    </soap:Header>
    <soapenv:Body>
        <pan:TEMPSTORAGEREQ xmlns:pan="http://pan.prpall.webservice.cmp.com">
            <pan:BIZ_ENTITY>
                <CarQuoteGenReq>
                    <BIZORIGIN>2</BIZORIGIN>
                    <CHANNELCODE>12</CHANNELCODE>
                    <COMCODE>43000000</COMCODE>
                    <LASTBIZPOLICYNO></LASTBIZPOLICYNO>
                    <LASTCIPOLICYNO></LASTCIPOLICYNO>
                    <LICENSENO>暂未上牌</LICENSENO>
                    <LICENSETYPE>02</LICENSETYPE>
                    <LICENSECOLORCODE>01</LICENSECOLORCODE>
                    <CARKINDCODE>A01</CARKINDCODE>
                    <ENGINENO>201606031641130</ENGINENO>
                    <FRAMENO>20160603164113000</FRAMENO>
                    <VINNO>20160603164113000</VINNO>
                    <ENROLLDATE>2016-06-03</ENROLLDATE>
                            <CLAUSETYPE>F42</CLAUSETYPE>
                    <USENATURECODE>211</USENATURECODE>
                    <RUNAREACODE>11</RUNAREACODE>
                    <MODELCODE>DZAAAD0053</MODELCODE>
                    <BRANDNAME>帕萨特SVW7203EPD轿车</BRANDNAME>
                    <MAKEDATE/>
                        <SEATCOUNT>5</SEATCOUNT>
                        <EXHAUSTSCALE>0.000</EXHAUSTSCALE>
                    <COUNTRYNATURE>C</COUNTRYNATURE>
                    <CURRENCY>CNY</CURRENCY>
                        <CHGOWNERFLAG>0</CHGOWNERFLAG>
                        <CHGOWNERDATE></CHGOWNERDATE>
                        <LOANVEHICLEFLAG>0</LOANVEHICLEFLAG>
                    <CARINSUREDRELATION>1</CARINSUREDRELATION>
                    <VEHICLE_BRAND>VW</VEHICLE_BRAND>
                        <LICENSEFLAG>0</LICENSEFLAG>
                        <STARTDATEBI>2016-06-04</STARTDATEBI>
                        <STARTHOURBI>00</STARTHOURBI>
                        <ENDDATEBI>2017-06-03</ENDDATEBI>
                        <ENDHOURBI>24</ENDHOURBI>
                        <STARTDATECI>2016-06-04</STARTDATECI>
                        <STARTHOURCI>00</STARTHOURCI>
                        <ENDDATECI>2017-06-03</ENDDATECI>
                        <ENDHOURCI>24</ENDHOURCI>
                        <RENEWALFLAG>03</RENEWALFLAG>
                    <AGENTCODE>12</AGENTCODE>
                    <NODAMAGEYEARS></NODAMAGEYEARS>
                    <LASTDAMAGEDBI>0</LASTDAMAGEDBI>
                    <THISDAMAGEDBI>0</THISDAMAGEDBI>
                    <NODAMYEARSBI>0</NODAMYEARSBI>
                    <LASTDAMAGED>0</LASTDAMAGED>
                    <RATERLOATFLAG>0</RATERLOATFLAG>
                    <NODAMYEARSCI>0</NODAMYEARSCI>
                    <LASTDAMAGEDCI>0</LASTDAMAGEDCI>
                    <THISDAMAGEDCI>0</THISDAMAGEDCI>
                    <REMARK1></REMARK1>
                    <REMARK2></REMARK2>
                    <NODAMAGEYEARSBI>0</NODAMAGEYEARSBI>
                    <GROUPCODE></GROUPCODE>
                    <UNITTYPE></UNITTYPE>
                    <VEHICLETYPEDESCRIPTION></VEHICLETYPEDESCRIPTION>
                    <TAXPAYERTYPE></TAXPAYERTYPE>
                    <DRIVLICENSECODE></DRIVLICENSECODE>
                    <FUEL_TYPE></FUEL_TYPE>
                    <CERTIFICATE_TYPE></CERTIFICATE_TYPE>
                    <CERTIFICATE_NO></CERTIFICATE_NO>
                    <RENEWAL_TYPE>0</RENEWAL_TYPE>
                    <AGENTTYPE></AGENTTYPE>
                    <EXT2></EXT2>
                    <EXT3></EXT3>
                    <PROJECTCODE></PROJECTCODE>
                    <PROFIT_OPERATEMODE></PROFIT_OPERATEMODE>
                    <MONOPOLYCODE>12</MONOPOLYCODE>
                    <MONOPOLYFLAG>1</MONOPOLYFLAG>
                    <MONOPOLYNAME>12</MONOPOLYNAME>
                    <RESOURCES>0531</RESOURCES>
                    <handler1code_uni></handler1code_uni>
                    <handlercode_uni></handlercode_uni>
                    <QUERYAREA>430000</QUERYAREA>
                        <CarQuoteCarShipTax>
                            <TAXTYPE>1</TAXTYPE>
                            <TAXABATETYPE></TAXABATETYPE>
                            <TAXABATEREASON></TAXABATEREASON>
                            <CALCULATEMODE>C2</CALCULATEMODE>
                            <TAXPAYERIDENTNO>44528119801104591X</TAXPAYERIDENTNO>
                            <TAXPAYERNUMBER></TAXPAYERNUMBER>
                                <TAXPAYERCODE>1</TAXPAYERCODE>
                            <TAXPAYERNAME>自动化</TAXPAYERNAME>
                            <TAXPAYERNATURE>3</TAXPAYERNATURE>
                            <TAXCOMCODE></TAXCOMCODE>
                            <TAXCOMNAME></TAXCOMNAME>
                            <DUTYPAIDPROOFNO></DUTYPAIDPROOFNO>
                            <TAXPRINTPROOFNO></TAXPRINTPROOFNO>
                            <TAXUNITAMOUNT></TAXUNITAMOUNT>
                            <PREPAYTAXYEAR></PREPAYTAXYEAR>
                            <PREPOLICYENDDATE></PREPOLICYENDDATE>
                            <CURRENCY>CNY</CURRENCY>
                            <TAXUNIT></TAXUNIT>
                            <THISPAYTAX></THISPAYTAX>
                            <PREPAYTAX></PREPAYTAX>
                            <DELAYPAYTAX></DELAYPAYTAX>
                            <SUMPAYTAX></SUMPAYTAX>
                            <TAXPAYERNO></TAXPAYERNO>
                            <PAYSTARTDATE>2016-06-03</PAYSTARTDATE>
                            <PAYENDDATE>2016-12-31</PAYENDDATE>
                        </CarQuoteCarShipTax>
                        <CarQuoteCarDeviceList/>
                        <CarQuoteItemKindBIList>
                                <CarQuoteItemKindBI>
                                    <KINDCODE>050600</KINDCODE>
                                    <KINDNAME>第三者责任保险</KINDNAME>
                                    <ITEMKINDNO>1</ITEMKINDNO>
                                        <AMOUNT>50000.00</AMOUNT>
                                        <UNITAMOUNT></UNITAMOUNT>
                                        <QUANTITY></QUANTITY>
                                    <FLAG> 1001000</FLAG>
                                        <CALCULATEFLAG>Y</CALCULATEFLAG>
                                </CarQuoteItemKindBI>
                                <CarQuoteItemKindBI>
                                    <KINDCODE>050911</KINDCODE>
                                    <KINDNAME>不计免赔率（车损险）</KINDNAME>
                                    <ITEMKINDNO>2</ITEMKINDNO>
                                        <AMOUNT/>
                                        <UNITAMOUNT></UNITAMOUNT>
                                        <QUANTITY></QUANTITY>
                                    <FLAG> 2000000</FLAG>
                                        <CALCULATEFLAG>N</CALCULATEFLAG>
                                </CarQuoteItemKindBI>
                                <CarQuoteItemKindBI>
                                    <KINDCODE>050912</KINDCODE>
                                    <KINDNAME>不计免赔率（三者险）</KINDNAME>
                                    <ITEMKINDNO>3</ITEMKINDNO>
                                        <AMOUNT/>
                                        <UNITAMOUNT></UNITAMOUNT>
                                        <QUANTITY></QUANTITY>
                                    <FLAG> 2000000</FLAG>
                                        <CALCULATEFLAG>N</CALCULATEFLAG>
                                </CarQuoteItemKindBI>
                                <CarQuoteItemKindBI>
                                    <KINDCODE>050200</KINDCODE>
                                    <KINDNAME>机动车损失保险</KINDNAME>
                                    <ITEMKINDNO>4</ITEMKINDNO>
                                            <AMOUNT/>
                                        <UNITAMOUNT></UNITAMOUNT>
                                        <QUANTITY></QUANTITY>
                                    <FLAG> 1001000</FLAG>
                                        <CALCULATEFLAG>Y</CALCULATEFLAG>
                                </CarQuoteItemKindBI>
                        </CarQuoteItemKindBIList>
                    <CarQuoteBasePartBIReq>
                        <QUERYSEUQENCENO></QUERYSEUQENCENO>
                            <ANSWER></ANSWER>
                            <ISRENEWALFLAG>0</ISRENEWALFLAG>
                    </CarQuoteBasePartBIReq>
                    <CarQuoteItemKindCIList>
                        <CarQuoteItemKindCI>
                            <KINDNAME>机动车强制责任保险</KINDNAME>
                            <ITEMKINDNO>1</ITEMKINDNO>
                            <KINDCODE>050100</KINDCODE>
                            <AMOUNT>122000</AMOUNT>
                            <UNITAMOUNT>122000</UNITAMOUNT>
                            <CALCULATEFLAG>Y</CALCULATEFLAG>
                        </CarQuoteItemKindCI>
                    </CarQuoteItemKindCIList>
                    <CarQuoteBasePartCIReq>
                        <QUERYSEUQENCENO></QUERYSEUQENCENO>
                            <ANSWER></ANSWER>
                            <ISRENEWALFLAG>0</ISRENEWALFLAG>
                    </CarQuoteBasePartCIReq>
                    <CarQuoteInsuredIndivList>
                            <CarQuoteInsuredIndiv>
                                <SERIALNO>1</SERIALNO>
                                <INSUREDFLAG>1110100</INSUREDFLAG>
                                <INSUREDCODE>1</INSUREDCODE>
                                <INSUREDNAME>自动化</INSUREDNAME>
                                <INSUREDADDRESS>北京市朝阳区</INSUREDADDRESS>
                                    <INSUREDNATURE>1</INSUREDNATURE>
                                    <IDENTIFYTYPE>01</IDENTIFYTYPE>
                                <IDENTIFYNUMBER>44528119801104591X</IDENTIFYNUMBER>
                                        <MOBILE>13800138000</MOBILE>
                                <AUDITSTATUS>2</AUDITSTATUS>
                                <VERSIONNO>1</VERSIONNO>
                                <SEX></SEX>
                                <COUNTRYCODE>CHN</COUNTRYCODE>
                                        <RESIDENT>A</RESIDENT>
                            </CarQuoteInsuredIndiv>
                    </CarQuoteInsuredIndivList>
                </CarQuoteGenReq>
            </pan:BIZ_ENTITY>
        </pan:TEMPSTORAGEREQ>
    </soapenv:Body>
</soapenv:Envelope>